src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3485b53-c447-4b51-8a87-ed842c7cd798">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3137eca7-6071-45f0-afe3-ffdf9416ea64">
    <name>НомерДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ОсновныеДоговорыКонтрагента/ОсновныеДоговорыКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="41d928f3-1fa4-43be-ab7e-a46d7695ed84">
  <name>ОсновныеДоговорыКонтрагента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d4312ce7-69c2-44c1-8318-c30c6dc90ff9">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="f03eca1c-a94b-4a98-b48a-4ab3edee0404">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8d15bb45-c4b0-4c7a-842a-9c40d88e872d">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="337d6cd7-6433-44a2-9149-c8148437e71c">
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ДоговорыКонтрагентов/ManagerModule.bsl
Функция am_ДоговорПоУмолчанию(Контрагент, Организация = Неопределено) Экспорт
	Если ТипЗнч(Контрагент) = Тип("СправочникОбъект.Контрагенты") Тогда
		КонтрагентСсылка = Контрагент.Ссылка;
	Иначе
		КонтрагентСсылка = Контрагент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеДоговорыКонтрагента.Договор
	|ИЗ
	|	РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|ГДЕ
	|	ОсновныеДоговорыКонтрагента.Контрагент = &Контрагент
	|	И НЕ ОсновныеДоговорыКонтрагента.Договор.Ссылка ЕСТЬ NULL
	|	И ОсновныеДоговорыКонтрагента.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	Возврат Выборка.Договор;
КонецФункции
